; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v7 - type_1 ?v2 - type_3)
 	      (pred_1 ?v6 - object ?v2 - type_3)
	      (pred_4 ?v7 - type_1 ?v5 - type_2)
	      (pred_2 ?v7 - type_1 ?v6 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v7 - type_1 ?v4 ?v1 - type_3)
       :precondition (and  (pred_3 ?v7 ?v4))
       :effect (and  (pred_3 ?v7 ?v1)
		     (not (pred_3 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v8) (pred_3 ?v7 ?v8) (pred_4 ?v7 ?v5))
       :effect (and (pred_2 ?v7 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v8)) 
		    (not (pred_4 ?v7 ?v5))))

   (:action op_3
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v3 ?v5) (pred_3 ?v7 ?v8))
       :effect (and (pred_1 ?v3 ?v8)
		    (pred_4 ?v7 ?v5)
		    (not (pred_2 ?v7 ?v3 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_05 obj_04 - type_2
obj_07 obj_08 obj_03 - type_3
obj_09 obj_01 obj_06 - object)
(:init
(pred_3 obj_02 obj_07)
(pred_4 obj_02 obj_05)
(pred_4 obj_02 obj_04)
(pred_1 obj_09 obj_03)
(pred_1 obj_01 obj_08)
(pred_1 obj_06 obj_07)
)
(:goal
(and
(pred_1 obj_09 obj_08)
(pred_1 obj_01 obj_03)
(pred_1 obj_06 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_05))))
)
)

; plan
1. (op_2 obj_02 obj_07 obj_08)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_08)
   goals met: 1 of 3
2. (op_1 obj_02 obj_01 obj_08 obj_04)
   deleted: (pred_1 obj_01 obj_08) (pred_4 obj_02 obj_04)
   added: (pred_2 obj_02 obj_01 obj_04)
   goals met: 1 of 3
3. (op_2 obj_02 obj_08 obj_03)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_03)
   goals met: 1 of 3
4. (op_3 obj_02 obj_01 obj_03 obj_04)
   deleted: (pred_2 obj_02 obj_01 obj_04)
   added: (pred_1 obj_01 obj_03) (pred_4 obj_02 obj_04)
   goals met: 2 of 3
5. (op_1 obj_02 obj_09 obj_03 obj_04)
   deleted: (pred_1 obj_09 obj_03) (pred_4 obj_02 obj_04)
   added: (pred_2 obj_02 obj_09 obj_04)
   goals met: 2 of 3
6. (op_2 obj_02 obj_03 obj_08)
   deleted: (pred_3 obj_02 obj_03)
   added: (pred_3 obj_02 obj_08)
   goals met: 2 of 3
7. (op_3 obj_02 obj_09 obj_08 obj_04)
   deleted: (pred_2 obj_02 obj_09 obj_04)
   added: (pred_1 obj_09 obj_08) (pred_4 obj_02 obj_04)
   goals met: 3 of 3
